Repository: tanzengehen/Kirundi-lemmatize-search
Catalog: i18n/*/LC_MESSAGES/messages.po
Languages: de

source: txt or json file or 'q' for 'quit'
de: txt oder json Datei oder 'q' für Abbruch

source: This file doesn't exist. {} Try again
de: Diese Datei gibt es hier nicht: {} Nächster Versuch

source: please give me a searchterm
de: die Suchanfrage bitte

source: '*' only for words, not for letters. Write searchterm again please
de: '*' nur für Wörter, nicht für einzelne Buchstaben neue Suchanfrage bitte

source: please enter the 'wtl' combination for your searchterms or 'q' for 'quit'
de: bitte eine entsprechende wtl-Kombination für die Suchanfrage eingeben oder 'q' für Abbruch

source: only 'w', '!w', 't', '!t', 'l', '!l' or '?'
de: nur 'w', '!w', 't', '!t', 'l', '!l' oder '?'

source: Hm, not as many as searchterms... Please again.
de: Die Anzahl von wtl passt nicht mit der Suchanfrage zusammen... Nochmal bitte.

source: all +
de: alles +

source: mismatch: wildcard {}.
de: Das passt nicht: Joker an {}. Stelle.

source: I go with the wildcard. Y/N :
de: Joker verwenden J/N :

source: yY
de: jJ

source: Start again
de: Nochmal von vorn

source: all except
de: alles außer

source: Invalid tag: {}. There will be no result.
de: Ungültiges Etikett: {}. Die Suche liefert kein Ergebnis.

source: Query = {}
de: Suchanfrage = {}

source: Select the Rundi text you want to inspect:
de: Wähle den kirundi Text aus, der untersucht werden soll:

source: c = whole tagged corpus
de: c = gesamter getaggter Korpus

source: path/to/file = a single file (txt or json)
de: pfad/zur/datei = einzelne Datei (txt oder json)

source: Prefer the tagged file, if there is one already.
de: Falls es schon eine zugehörige json Datei gibt, nimm eher die.

source: What are you looking for? Divide searchterms with space characters. You can put a '!' before a !word or !tag, if you want to exclude it. You can place a separate '*' for a wildcard. Possible PoS-tags: [ADJ, ADV, CONJ, EMAIL, F(foreign word), INTJ, NI, NOUN, NUM, NUM_ROM (roman number), PRON (pronouns), PROPN, PROPN_CUR, PROPN_LOC (geographical place), PROPN_NAM (personal name), PROPN_ORG, PROPN_PER (group of persons), PROPN_REL, PROPN_SCI, PROPN_THG, PROPN_VEG, PRP (prepositions), SYMBOL, UNK (unkwon to dictionary), VERB, WWW (webaddress)] Your searchterm
de: Wonach soll gesucht werden? Die Suchbegriffe bitte durch ein Leerzeichen voneinander trennen. Ein '!' direkt vor einem !Wort schliesst dieses Wort oder dieses Etikett explizit von der Suche aus. Ein freistehendes * ist ein Platzhalter für jedes beliebige Wort an dieser Stelle. Mögliche Etiketten: [ADJ, ADV, CONJ, EMAIL(anonymisiert), F(Fremdwort), INTJ, NI, NOUN, NUM, NUM_ROM(römische Zahlen), PRON(Pronomen), PROPN, PROPN_CUR, PROPN_LOC(Geografie), PROPN_NAM (Name), PROPN_ORG, PROPN_PER, PROPN_REL, PROPN_SCI, PROPN_THG, PROPN_VEG, PRP(Präposition), SYMBOL, UNK(dem Wörterbuch unbekannt), VERB, WWW(Webadresse)] Suchanfrage

source: OK, you are looking for a {}-gram.
de: Es wird ein {}-gram gesucht.

source: For distinction between type, tag and lemma chose for each part of the searchterm a letter...
de: Zur Unterscheidung zwischen Wort, Etikett und Lemma bitte pro Suchbegriff einen der folgenden Buchstaben eingeben...

source: W = this type L = all types of this lemma T = Part of Speech-tag ? = wildcard
de: W = exaktes Wort (Type) L = alle Types zu diesem Lemma T = Part of Speech-Tag (Wortart) ? = Joker

source: Sorry, I didn't save the list that starts with: {} I was expecting str, int, tuple or list as list elements.
de: Oh, die Liste, die mit {} beginnt, konnte nicht gespeichert werden, weil es darin unerwartete Listenelemente gibt. Gültig sind nur: str, int, tuple oder list.

source: lemma has no stem in database: ID{}
de: Diesem Lemma fehlt im Wörterbuch ein Eintrag für den Wortstamm: ID{}

source: perfective is lost: {}
de: für '{}' ist der Perfektiv verloren gegangen

source: {}: perfective? -{}
de: {}: Perfectiv? -{}

source: tried to add passiv to perfective but unknown letter before y
de: vom Perfektiv konnte kein Passiv gebildet werden (ungewöhnlicher Buchstabe vor dem y)

source: filter proverbs out doesn't work': {}
de: Redewendungen rauszufiltern funktioniert nicht: {}

source: filter passiv out doesn't work': {}
de: Passiv rauszufiltern funktioniert nicht: {}

source: sorting Named Entities ...........................
de: sortiere Eigennamen ..............................

source: Named Entities :
de: Eigennamen :

source: adverbs etc :
de: Adverben usw. :

source: pronouns :
de: Pronomen :

source: sorting nouns ....................................
de: Substantive werden sortiert ......................

source: nouns :
de: Substantive :

source: adjektives :
de: Adjektive :

source: sorting verbs ....................................
de: Verben werden sortiert ...........................

source: verbs :
de: Verben :

source: exclamations :
de: Ausrufe :

source: Vocabulary characters : {nchar} tokens : {ntokens} types : {ntypes}
de: Wortschatz Zeichen : {nchar} Token : {ntokens} Types : {ntypes}

source: unknown types : {} ({}%)
de: unbekannte Types : {} ({}%)

source: recognized lemmata : {}
de: erkannte Lemmata : {}

source: tagging text, this may take some moments .........
de: Wörter werden etikettiert, das kann etwas dauern...

source: Error: missing tag
de: Ups, ein Fehler: das Etikett fehlt

source: All tagged files saved in:
de: Der etikettierte Text wurde in folgender Datei gespeichert:

source: We can use them again later.
de: Darauf kann später erneut zugegriffen werden.

source: Statistics characters {char} (broken char from bad OCR: {odds}) tokens {tokensbond} tokens (split by ') {tokens_split} types {types} recognized lemmata {lemmata} unknown types {unk}
de: Statistik Zeichen {char} (kaputte Zeichen wegen grottiger OCR: {odds}) Tokens {tokensbond} Tokens (getrennt bei ') {tokens_split} Types {types} erkannte Lemmata {lemmata} unsortierte Types {unk}

source: Preparing file ...
de: die Datei wird eingelesen ...

source: Are you sure, that this is a tagged file?
de: Ist das ganz sicher eine Datei mit Etiketten?

source: There is already a tagged file: (made {})
de: Es gibt von diesem Text bereits eine Datei mit Etiketten: (vom {})

source: We use this instead of tagging again.
de: Statt nochmal neu zu etikettieren, wird diese Datei benutzt.

source: Sorry, can't use the file: {}
de: Tut mir leid, folgende Datei kann nicht eingelesen werden: {}

source: Tagged file saved as:
de: Der etikettierte Text wurde in folgender Datei gespeichert:

source: We can use it again later.
de: Darauf kann später erneut zugegriffen werden.

source: You searched this already
de: Das wurde schon gesucht

source: Hit 1-20 (out of {}). All results are saved in file:
de: Treffer 1-20 von {}. Alle Suchergebnisse wurden in folgender Datei gepeichert:

source: No results for this query.
de: Keine Treffer für diese Suchanfrage gefunden.
