Repository: tanzengehen/Kirundi-lemmatize-search
Catalog: i18n/rn/LC_MESSAGES/messages.po
Languages: rn

source: txt or json file or 'q' for 'quit'
rn: ifishi txt canke json canke 'q' kugira ndaheze (quit)

source: This file doesn't exist. {} Try again
rn: Iri fishi ntarihari. {} Subiramwo

source: please give me a searchterm
rn: ndagusavye, andika ikibazo c'ukurondeza

source: '*' only for words, not for letters. Write searchterm again please
rn: '*' ikoreshwa n'amajambo gusa, nturikoreshe n'indome. Ndagusavye subira kwandika ikibazo c'ukurondeza

source: please enter the 'wtl' combination for your searchterms or 'q' for 'quit'
rn: nimwandika ugushirahamwe kurajanya n'ikibazo c'ukurondeza canke 'q' kugira ndaheze

source: only 'w', '!w', 't', '!t', 'l', '!l' or '?'
rn: 'w', '!w', 't', '!t', 'l', '!l' canke '?' gusa

source: Hm, not as many as searchterms... Please again.
rn: Uhm, igitigiri c'ibice vy'ikibazo c'ukurondeza ntikingana n'igitigiri c'ugushirahamwe wtl... Ndagusavye subiramwo.

source: all +
rn: vyose +

source: mismatch: wildcard {}.
rn: ntibjana: ijokeri mu kibanza ca {}.

source: I go with the wildcard. Y/N :
rn: Ndakoreshe ijokery. Ego/Oya :

source: yY
rn: eE

source: Start again
rn: Subira mu ntango

source: all except
rn: vyose kiretse

source: Invalid tag: {}. There will be no result.
rn: Sihari indanzi: {}. Nta gisubizo hari.

source: Query = {}
rn: Ikibazo c’ukurondeza = {}

source: Select the Rundi text you want to inspect:
rn: Tora igisomwa c'ikirundi ushaka kwihweza:

source: c = whole tagged corpus
rn: c = corpus yose n'indanzi

source: path/to/file = a single file (txt or json)
rn: inzira/ku/fishi = ifishi rimwe (txt canke json)

source: Prefer the tagged file, if there is one already.
rn: Nyabuna ifishi n'indanzi mu gihe rihari.

source: What are you looking for? Divide searchterms with space characters. You can put a '!' before a !word or !tag, if you want to exclude it. You can place a separate '*' for a wildcard. Possible PoS-tags: [ADJ, ADV, CONJ, EMAIL, F(foreign word), INTJ, NI, NOUN, NUM, NUM_ROM (roman number), PRON (pronouns), PROPN, PROPN_CUR, PROPN_LOC (geographical place), PROPN_NAM (personal name), PROPN_ORG, PROPN_PER (group of persons), PROPN_REL, PROPN_SCI, PROPN_THG, PROPN_VEG, PRP (prepositions), SYMBOL, UNK (unkwon to dictionary), VERB, WWW (webaddress)] Your searchterm
rn: Ushaka gusanga iki? Ukeneye gusa gutandukanya amajambo yo kurondeza ukoresheje umwanya. '!' imbere y'!ijambo bivuga ko gukuramwo iri jambo canke iyi ndanzi '*' hagati y’amajambo yo kurondeza bivuga iri Token ni jokeri Indanzi zishoboka: [ADJ(ingereka), ADV, CONJ, EMAIL, F(ijambo rya hanze), INTJ, NI, NOUN(izina ndongoramvugo), NUM, NUM_ROM(igiharuro c'abaromani), PRON(insigarirazina), PROPN, PROPN_CUR(amafaranga), PROPN_LOC(izina ry'ikibanza), PROPN_NAM(izina ry'umuntu), PROPN_ORG, PROPN_PER (umurwi w'abantu), PROPN_REL, PROPN_SCI, PROPN_THG, PROPN_VEG(ikimera), PRP (prepositions), SYMBOL, UNK (atazwi mu kazinduzi), VERB, WWW (webaddress)] Ikibazo c'ukurondeza

source: OK, you are looking for a {}-gram.
rn: Sawa, urarondera {}-gram.

source: For distinction between type, tag and lemma chose for each part of the searchterm a letter...
rn: Kugira dutandukanye hagati type, indanzi na lemma, mpa indome ijanya na kira gice c'ikibazo c'ukurondeza...

source: W = this type L = all types of this lemma T = Part of Speech-tag ? = wildcard
rn: W = iri jambo (type) L = amajambo yose ajanya n'iri lemma T = indanzi ya Part of Speech ? = ijokeri

source: Sorry, I didn't save the list that starts with: {} I was expecting str, int, tuple or list as list elements.
rn: Murantunga, sinashinguye urutondo rutangurwa: {} Ndashobora gukoresha intonde zunzwe na 'str', na 'int', na 'tuple' canke na 'list' gusa.

source: lemma has no stem in database: ID{}
rn: iri lemma ntirifise stem muri kazinduzi: ID{}

source: perfective is lost: {}
rn: intunganyi irabuze: {}

source: tried to add passiv to perfective but unknown letter before y
rn: nagerageje kwongera inkorerwa y'intunganyi ariko hari urudome ntirusanzwe imbere ya y

source: filter proverbs out doesn't work': {}
rn: ntibikunda kugosora imyibutsa: {}

source: filter passiv out doesn't work': {}
rn: ntibikunda kugosora inkorerwa {}

source: sorting Named Entities ...........................
rn: kugosora amazina y’abantu, y’ibibanza n’ibindi bintu ...

source: Named Entities :
rn: amazina y’abantu, y'ibibanza, … :

source: adverbs etc :
rn: adverbs n'ibindi kintu nk'ivyo :

source: pronouns :
rn: insigarirazina :

source: sorting nouns ....................................
rn: kugosora amazina ndongoramvugo ....................

source: nouns :
rn: amazina :

source: adjektives :
rn: ingereka :

source: sorting verbs ....................................
rn: kugosora amavuga .................................

source: verbs :
rn: amavuga :

source: exclamations :
rn: ingereka :

source: Vocabulary characters : {nchar} tokens : {ntokens} types : {ntypes}
rn: Amajambo indome : {nchar} tokens : {ntokens} types : {ntypes}

source: unknown types : {} ({}%)
rn: types zitazwi : {} ({}%)

source: recognized lemmata : {}
rn: amalemma azwi : {}

source: tagging text, this may take some moments .........
rn: Ndiko ndamatira indanzi n'amajambo, biramara akanya...

source: Error: missing tag
rn: Hari ikosa: indanzi irabuze

source: All tagged files saved in:
rn: Igisomwa kiranze cashinguwe mu fishi:

source: We can use them again later.
rn: Turashobora gusubira kuyikoresha ikindi gihe.

source: Statistics characters {char} (broken char from bad OCR: {odds}) tokens {tokensbond} tokens (split by ') {tokens_split} types {types} recognized lemmata {lemmata} unknown types {unk}
rn: Ibiharuro indome {char} (broken char from bad OCR: {odds}) tokens {tokensbond} tokens (guca na ') {tokens_split} types {types} amalemma azwi {lemmata} types ntizizwi {unk}

source: Preparing file ...
rn: Ndiko ndategura ifishi ...

source: Are you sure, that this is a tagged file?
rn: Urazi neza ko ico ni ifishi n'indanzi?

source: There is already a tagged file: (made {})
rn: Hari ifishi n'indanzi: (ryagizwe ku wa {})

source: We use this instead of tagging again.
rn: Nkoresha iyo fishi mu kurondeza hako nsubira kuranga.

source: Sorry, can't use the file: {}
rn: Murantunga sinshobora gukoresha iyi fishi: {}

source: Tagged file saved as:
rn: Igisomwa kiranze cashinguwe mu fishi:

source: We can use it again later.
rn: Turashobora gusubira kuyikoresha ikindi gihe.

source: You searched this already
rn: Iki kibazo c'ukurondeza ntikiri gishasha

source: Hit 1-20 (out of {}). All results are saved in file:
rn: Ibisubizo vya mbere 20 (hari {}). Vyose vyashinguwe mu fishi:

source: No results for this query.
rn: Nta gisubizo c'ukuronka.
